backend/controllers/DashboardController.php

    public function actionIndex()
    {
        $activeAdsCount=PostAd::find()->where(['status'=>PostAd::STATUS_ACTIVE])->count();
        $newAdsCount=PostAd::find()->where(['status'=>PostAd::STATUS_PENDING])->count();
        $allusersCount=User::find()->where(['user_type'=>'user'])->count();
---
SELECT COUNT(*) FROM `post_ads` WHERE `status`='Active'
SELECT COUNT(*) FROM `post_ads` WHERE `status`='Pending'
SELECT COUNT(*) FROM `user` WHERE `user_type`='user'