backend/controllers/PostAdController.php

SELECT * FROM `ads_images` WHERE `ad_id`='86'
SELECT `id`, `ad_id`, `field_id`, `value` FROM `post_ads_custom_fields` WHERE `ad_id`='86'
SELECT `custom_fields`.`id`, `custom_fields`.`field_type_id`, `custom_fields`.`label`, `custom_fields`.`isRequired`, `custom_field_types`.`id` AS `custom_type_id`, `custom_field_types`.`type` FROM `custom_fields` LEFT JOIN `custom_field_types` ON custom_fields.field_type_id = custom_field_types.id WHERE `custom_fields`.`id`='4'
---
    public function actionView($id)
    {
        $model=$this->findModel($id);
        $advertiser = $model->user_id;
        $advertiser_detail = UserProfile::getUserDetail($advertiser);
        $postAd=AppHelper::getPostAdDetail($id);

        $ad_views_count = AdViews::AdViewsCountByAdId($id);

        $ads_images=PostAdImages::find()->where(['ad_id'=>$id])->all();

        $custom_field_ids = (new \yii\db\Query())
            ->select(['id','ad_id','field_id','value'])
            ->from('post_ads_custom_fields	')
            ->where(['ad_id' => $id])
            ->all();
        // echo "<pre>"; print_r($custom_field_ids);exit;

        $b = 1;
        $ArrCustomFields = array();
        foreach($custom_field_ids as $key=>$custom_field_id){
            $custom_fields = (new \yii\db\Query())
                ->select(['custom_fields.id','custom_fields.field_type_id','custom_fields.label','custom_fields.isRequired','custom_field_types.id as custom_type_id','custom_field_types.type'])
                ->from('custom_fields')
                ->leftjoin('custom_field_types', 'custom_fields.field_type_id = custom_field_types.id')
                ->where(['custom_fields.id' => $custom_field_id['field_id']])
                ->all();

SELECT * FROM `warning_reasons` WHERE `type`=''
---
    public function actionWarnmessage() {
        $model = new \common\models\WarningReasons();
        $reason_array = array('Please Select');
        if (Yii::$app->request->post()) {
            $post = Yii::$app->request->post();
            $value = $post['value'];

            $reasons = $model->find()->where(['type' => $value])->all();

SELECT * FROM `post_ads` WHERE `id`='86'
---
    protected function findModel($id)
    {
        if (($model = PostAd::findOne($id)) !== null) {