frontend/controllers/SiteController.php

SELECT * FROM `post_ads` WHERE `status`='Active' ORDER BY `id` DESC LIMIT 9
SELECT COUNT(*) FROM `post_ads` WHERE `status`='Active'
SELECT * FROM `ads_category` WHERE `ad_id`='86'
SELECT * FROM `ads_images` WHERE `ad_id`='86'
---
    public function actionIndex()
    {
		$states = States::getStates();
		$userId = Yii::$app->user->identity['id'];

		$allAds = (new \yii\db\Query())
				->select(['*'])
				->from('post_ads')
				->where(['status'=>"Active"])
				->limit(9)
				->orderBy(['id' => SORT_DESC])
				->all();
		$allAdsCount = 	(new \yii\db\Query())
					->select(['*'])
					->from('post_ads')
					->where(['status'=>"Active"])
					->orderBy(['id' => SORT_DESC])
					->count();

		$i = 0;
		$ArrAds = array();

		foreach($allAds as $key=>$value){

			$cat_id = (new \yii\db\Query())
					->select(['*'])
					->from('ads_category')
					->where(['ad_id' => $value['id']])
					->all();
			$value['category_id'] =  $cat_id;
			$ArrAds[$i] = $value;

			$images = (new \yii\db\Query())
					->select(['*'])
					->from('ads_images')
					->where(['ad_id' => $value['id']])
					->all();

SELECT * FROM `post_ads` WHERE (`user_id`=12) AND (`ad_type` IN ('featured', 'highlight', 'urgent')) AND (`status`='Active') ORDER BY `id` DESC
SELECT * FROM `post_ads` WHERE `slug`='fffffffff'
---
     public function actionAdDetail($slug) {

		$userId = Yii::$app->user->identity['id'];
		$allAds = (new \yii\db\Query())
			->select(['*'])
			->from('post_ads')
			->where(['status'=> PostAd::STATUS_ACTIVE])
			->andWhere(['ad_type'=> PostAd::STATUS_ACTIVE])
			->where(['user_id' => $userId])
			->andWhere(['ad_type' => array('featured','highlight','urgent')])
			->andWhere(['status' => PostAd::STATUS_ACTIVE])
			->orderBy(['id' => SORT_DESC])
			->all();

	    $title = 'Ad Detail';
	    if($userId){
			$adDetail = (new \yii\db\Query())
			->select(['*'])
			->from('post_ads')
			->where(['slug' => $slug])
			->one();

SELECT * FROM `ad_views` WHERE (`ad_id`='87') AND (`ip_address`='192.168.1.26')
---
		$ad_id = 	$adDetail['id'];
		$ip_address = $_SERVER['REMOTE_ADDR'];

		$check_ip = (new \yii\db\Query())
					->select(['*'])
					->from('ad_views')
					->where(['ad_id' => $ad_id])
					->andWhere(['ip_address' => $ip_address])
					->one();

SELECT * FROM `ads_category` WHERE `ad_id`='87'
SELECT * FROM `ads_images` WHERE `ad_id`='87'
SELECT `id`, `ad_id`, `field_id`, `value` FROM `post_ads_custom_fields` WHERE `ad_id`='87'
---

		$i = 1;
		$ArrAds = array();
		$cat_id = (new \yii\db\Query())
					->select(['*'])
					->from('ads_category')
					->where(['ad_id' => $adDetail['id']])
					->all();
		$adDetail['category_id'] =  $cat_id;

		$images = (new \yii\db\Query())
					->select(['*'])
					->from('ads_images')
					->where(['ad_id' => $adDetail['id']])
					->all();
		$adDetail['ads_images'] =  $images;

		$custom_field_ids = (new \yii\db\Query())
					->select(['id','ad_id','field_id','value'])
					->from('post_ads_custom_fields	')
					->where(['ad_id' => $adDetail['id']])
					->all();

SELECT `ad_id` FROM `ads_category` WHERE `cat_id`='1'
---
		//echo "<pre>"; print_r($ArrAds);exit;
		$cat_id = $adDetail['category_id'][0]['cat_id'];

		$related_ads_ids = (new \yii\db\Query())
							->select(['ad_id'])
							->from('ads_category')
							->where(['cat_id' => $cat_id])
							->all();

SELECT * FROM `post_ads` WHERE (`status`='Active') AND (`id`='1') AND (`id` != '87') ORDER BY `id` DESC
---
			$ad_list_arrays = array();
			$a = 1;
			foreach($related_ads_ids as $key=>$value){
				$ad_list = (new \yii\db\Query())
							->select(['*'])
							->from('post_ads')
							->where(['status'=> PostAd::STATUS_ACTIVE])
							->andWhere(['id'=> $value['ad_id']])
							->andWhere(['!=', 'id', $adDetail['id']])
							->orderBy(['id' => SORT_DESC])
							->one();

SELECT * FROM `ads_category` WHERE `ad_id`='1'
SELECT * FROM `ads_images` WHERE `ad_id`='1'
---
			foreach($ad_list_arrays as $key=>$value){


				$cat_id = (new \yii\db\Query())
						->select(['*'])
						->from('ads_category')
						->where(['ad_id' => $value['id']])
						->one();
				$value['category_id'] =  $cat_id;
				$RelatedAds[$j] = $value;

				$images = (new \yii\db\Query())
						->select(['*'])
						->from('ads_images')
						->where(['ad_id' => $value['id']])
						->one();