common/components/AppFileUploads.php

SELECT * FROM `user_profile` WHERE `user_id`=12
---
    public static function updateProfileImage($user_id,$files){

		$s3Enable = Settings::getSettingByName('s3_bucket');
		$s3BucketPath = Settings::getSettingByName('s3_bucket_url');
		$localPath = Settings::getSettingByName('image_url_localpath');

        $model = UserProfile::findOne(['user_id' => $user_id]);