common/components/AppHelper.php

    public static function getCategoryImage($category_id){
        $image='';
        $categoryImage=CategoriesMedia::find()->where(['category_id'=>$category_id])->one();
        if(!empty($categoryImage)){
            $mediaupload=MediaUpload::findOne($categoryImage->media_id);
---
SELECT * FROM `categories_media` WHERE `category_id`='1'
SELECT * FROM `media_upload` WHERE `id`=9

    public static function getSubCategory($category_id){
        $sub_categories=Categories::find()->where(['parent_id'=>$category_id])->all();
---
SELECT * FROM `categories` WHERE `parent_id`='1'

    public static function getSiteLogo(){
        $url= Url::to('@frontendUrl').'/images/br-classified.png';
        $setting=Settings::find()->where(['name'=>'logo'])->one();
---
SELECT * FROM `settings` WHERE `name`='logo'

	public function getAdsByPosition($position){
		$advertisement = (new \yii\db\Query())
					->from('advertising')
					->where(['slug' => $position])
					->one();
---
SELECT * FROM `advertising` WHERE `slug`='right_sidebar'

    public static function getUser_fullName($id) {
        $user = UserProfile::find()->where(['user_id' => $id])->one();
---
SELECT * FROM `user_profile` WHERE `user_id`=12

    public static function getUserDetail($id) {
        $user = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`=12

    public static function getAdTitle($id) {
        $advertisement = PostAd::find()->where(['id' => $id])->one();
---
SELECT * FROM `post_ads` WHERE `id`=6

    public static function getCustomFieldValue($value) {
       	$fieldvalue = (new \yii\db\Query())
					->select('label')
					->from('custom_field_options')
					->where(['id' => $value])
					->one()['label'];
---
SELECT `label` FROM `custom_field_options` WHERE `id`='27'

    public static function getPostAdDetail($postAd_id){
        $postAd_detail=array();
        $ad_detail=PostAd::findOne($postAd_id);
---
SELECT * FROM `post_ads` WHERE `id`='86'

    public static function getPostAdCategories($postAd_id){
        $cat_array=array(); $name_array=array();
        $label_category='';
        $categories = PostAdCategory::find()->joinWith('categories')
            ->andWhere(['ads_category.ad_id'=>$postAd_id])
            ->orderBy('categories.parent_id')
            ->all();

        $c=0;
        $name_array['category']='';
        $name_array['subcategory']='';
        foreach($categories as $category){
            $detail=Categories::findOne($category->cat_id);
---
SELECT `ads_category`.* FROM `ads_category` LEFT JOIN `categories` ON `ads_category`.`cat_id` = `categories`.`id` WHERE `ads_category`.`ad_id`='86' ORDER BY `categories`.`parent_id`
SELECT * FROM `categories` WHERE `id`=1

	public static function getUserSubscription($user_id) {
	$subscription = (new \yii\db\Query())
				->select('*')
				->from('user_subscription')
				->where(['user_id' => $user_id])
				->one();
---
SELECT * FROM `user_subscription` WHERE `user_id`=12

    public static function getUserProfileImage($user_id) {

		$s3Enable = Settings::getSettingByName('s3_bucket');
		$s3BucketPath = Settings::getSettingByName('s3_bucket_url');
		$localPath = Settings::getSettingByName('image_url_localpath');
		$userprofile = UserProfile::find()->where(['user_id' => $user_id])->one();
---
SELECT * FROM `user_profile` WHERE `user_id`=12