common/components/Olx.php

SELECT `categories`.*, `categories_lang`.`id` AS `cat_lang_id`, `categories_lang`.`category_id`, `categories_lang`.`locale`, `categories_lang`.`title` AS `cat_lang_title`, `categories_lang`.`description` AS `cat_lang_description`, `categories_lang`.`slug` AS `cat_lang_slug` FROM `categories` LEFT JOIN `categories_lang` ON `categories`.`id` = `categories_lang`.`category_id` WHERE (`categories`.`status`=1) AND (`categories`.`parent_id`=0)
---
	public static function getAllCategory($lang_app = null, $cat_id = null)
    {
		$cookies = Yii::$app->request->cookies;
		if(isset($cookies['_locale']) && !empty($cookies['_locale'])){
			$lang = $cookies['_locale']->value;
		}else if(!empty($lang_app)){
			$lang = $lang_app;
		}else{
			$lang = 'en';
		}

		if(!empty($cat_id)){
			$catId = $cat_id;
		}else{
			$catId = 0;
		}

		//$lang = $cookies['_locale']->value;

        $lists= new Query();
        $lists = Categories::find();
        $lists->select(['categories.*',
						  'categories_lang.id as  cat_lang_id',
						  'categories_lang.category_id','categories_lang.locale','categories_lang.title as cat_lang_title','categories_lang.description as cat_lang_description','categories_lang.slug as cat_lang_slug']);
        $lists->joinWith('categories_lang');
        $lists->andWhere(['categories.status' => 1,'categories.parent_id'=>$catId]);
        $lists->all();

SELECT `wishlist`.* FROM `wishlist` WHERE (`ad_id`='86') AND (`user_id` IS NULL)
---
    public static function wishlistData($user_id,$ad_id){
		$lists= new Query();
        $lists = Wishlist::find();
        $lists->select('wishlist.*');
        $lists->andWhere(['ad_id' => $ad_id,'user_id'=>$user_id]);
        $lists->one();