common/models/AdViews.php

    public function AdViewsCountByAdId($AdId){
		$adviewCount = (new \yii\db\Query())
					->from('ad_views')
					->where(['ad_id' => $AdId])
					->andwhere(['status' => 'Active'])
					->groupBy(['ip_address'])
					->count();
---
SELECT COUNT(*) FROM (SELECT * FROM `ad_views` WHERE (`ad_id`='87') AND (`status`='Active') GROUP BY `ip_address`) `c`