common/models/Cities.php

     public static function getCityById($cityId)
    {
		 $city_name = (new \yii\db\Query())
					->select(['name'])
					->from('cities')
					->where(['id' => $cityId])
					->one();
---
SELECT `name` FROM `cities` WHERE `id`='42492'