common/models/Countries.php

    public static function getAllCountries()
    {
		 $data = Countries::find()
		->select(['name', 'id'])
		->where(['status' => 1])
		->orderBy(['id' => SORT_ASC])
		->indexBy('id')
		->asArray()
		->column();
---
SELECT `name`, `id` FROM `countries` WHERE `status`=1 ORDER BY `id`

    public static function getCountryById($countryId)
    {
		 $country_name = (new \yii\db\Query())
					->select(['name'])
					->from('countries')
					->where(['id' => $countryId])
					->one();
---
SELECT `name` FROM `countries` WHERE `id`='113'