common/models/MediaUpload.php

SELECT * FROM `media_upload` WHERE `id`='122'
---
    public static function getImageByMediaId($mediaId)
    {
		$image = (new \yii\db\Query())
					->select(['*'])
					->from('media_upload')
					->where(['id' => $mediaId])
					->one();