common/models/Packages.php

     public function AllPackages($user_id = null) {

		$title = Yii::t('frontend', 'Membership Plans');
		if(!empty($user_id)){
			$userId = $user_id;
		}else{
			$userId = Yii::$app->user->identity['id'];
		}

		$allPackages = (new \yii\db\Query())
				->select(['*'])
				->from('packages')
				->orderBy(['id' => SORT_DESC])
				->all();
---
SELECT * FROM `packages` ORDER BY `id` DESC