common/models/Plans.php

SELECT `plans`.*, `packages`.`id` AS `pack_id`, `packages`.`name` AS `pack_name`, `packages`.`ad_limit` AS `ad_limit`, `packages`.`ad_duration` AS `ad_duration`, `packages`.`featured_project_fee` AS `featured_project_fee`, `packages`.`featured_duration` AS `featured_duration`, `packages`.`urgent_project_fee` AS `urgent_project_fee`, `packages`.`urgent_duration` AS `urgent_duration`, `packages`.`highlight_project_fee` AS `highlight_project_fee`, `packages`.`highlight_duration` AS `highlight_duration`, `packages`.`group_removable` AS `group_removable`, `packages`.`top_search_result` AS `top_search_result`, `packages`.`show_on_home` AS `show_on_home`, `packages`.`show_in_home_search` AS `show_in_home_search` FROM `plans` LEFT JOIN `packages` ON plans.package_id = packages.id
---
      public function AllPlans($user_id = null) {

		$title = Yii::t('frontend', 'Membership Plans');
		if(!empty($user_id)){
			$userId = $user_id;
		}else{
			$userId = Yii::$app->user->identity['id'];
		}

		$allPlans = (new \yii\db\Query())
					->select(['plans.*','packages.id as pack_id','packages.name as pack_name','packages.ad_limit as ad_limit','packages.ad_duration as ad_duration','packages.featured_project_fee as featured_project_fee','packages.featured_duration as featured_duration','packages.urgent_project_fee as urgent_project_fee','packages.urgent_duration as urgent_duration','packages.highlight_project_fee as 	highlight_project_fee','packages.highlight_duration as 	highlight_duration','packages.group_removable as group_removable','packages.top_search_result as top_search_result','packages.show_on_home as show_on_home','packages.show_in_home_search as show_in_home_search'])
					->from('plans')
					->leftjoin('packages', 'plans.package_id = packages.id')
					->all();

SELECT `plans`.*, `packages`.`id` AS `pack_id`, `packages`.`name` AS `pack_name`, `packages`.`ad_limit` AS `ad_limit`, `packages`.`ad_duration` AS `ad_duration`, `packages`.`featured_project_fee` AS `featured_project_fee`, `packages`.`featured_duration` AS `featured_duration`, `packages`.`urgent_project_fee` AS `urgent_project_fee`, `packages`.`urgent_duration` AS `urgent_duration`, `packages`.`highlight_project_fee` AS `highlight_project_fee`, `packages`.`highlight_duration` AS `highlight_duration`, `packages`.`group_removable` AS `group_removable`, `packages`.`top_search_result` AS `top_search_result`, `packages`.`show_on_home` AS `show_on_home`, `packages`.`show_in_home_search` AS `show_in_home_search` FROM `plans` LEFT JOIN `packages` ON plans.package_id = packages.id WHERE `plans`.`id`='2'
---
     public function getPlanDetail($plan_id) {
		$plan_detail = (new \yii\db\Query())
					->select(['plans.*','packages.id as pack_id','packages.name as pack_name','packages.ad_limit as ad_limit','packages.ad_duration as ad_duration','packages.featured_project_fee as featured_project_fee','packages.featured_duration as featured_duration','packages.urgent_project_fee as urgent_project_fee','packages.urgent_duration as urgent_duration','packages.highlight_project_fee as 	highlight_project_fee','packages.highlight_duration as 	highlight_duration','packages.group_removable as group_removable','packages.top_search_result as top_search_result','packages.show_on_home as show_on_home','packages.show_in_home_search as show_in_home_search'])
					->from('plans')
					->where(['plans.id' => $plan_id])
					->leftjoin('packages', 'plans.package_id = packages.id')
					->one();