common/models/PostAd.php

SELECT COUNT(*) FROM `post_ads` WHERE `user_id`=12
---
    public function adsCountByUser($userId){
		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->count();

SELECT COUNT(*) FROM `post_ads` WHERE (`user_id`=12) AND (`ad_type` IN ('featured', 'highlight', 'urgent')) AND (`status`='Active')
---
	public function premiumAdsCountByUser($userId){

		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->andWhere(['ad_type' => array('featured','highlight','urgent')])
					->andWhere(['status' => PostAd::STATUS_ACTIVE])
					->count();

SELECT COUNT(*) FROM `post_ads` WHERE (`user_id`=12) AND (`status`='Pending')
---
	public function pendingAdsCount($userId){
		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->andWhere(['status' => PostAd::STATUS_PENDING])
					->count();

SELECT COUNT(*) FROM `post_ads` WHERE (`user_id`=12) AND (`status`='Active')
---
	public function activeAdsCount($userId){
		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->andWhere(['status' => PostAd::STATUS_ACTIVE])
					->count();

SELECT COUNT(*) FROM `post_ads` WHERE (`user_id`=12) AND (`status`='Warning')
---
	public function warningAdsCount($userId){
		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->andWhere(['status' => PostAd::STATUS_WARNING])
					->count();

SELECT COUNT(*) FROM `post_ads` WHERE (`user_id`=12) AND (`status`='Rejected')
---
	public function rejectedAdsCount($userId){
		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->andWhere(['status' => PostAd::STATUS_REJECTED])
					->count();

SELECT COUNT(*) FROM `post_ads` WHERE (`user_id`=12) AND (`status`='Hidden')
---
	public function hiddenAdsCount($userId){
		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->andWhere(['status' => PostAd::STATUS_HIDDEN])
					->count();

SELECT COUNT(*) FROM `post_ads` WHERE (`user_id`=12) AND (`status`='Resubmitted')
---
	public function resubmitAdsCount($userId){
		$adCount = (new \yii\db\Query())
					->from('post_ads')
					->where(['user_id' => $userId])
					->andWhere(['status' => PostAd::STATUS_RESUBMITTED])
					->count();

SELECT COUNT(*) FROM `wishlist` WHERE `user_id`=12
---
	public function favouriteAdsCount($userId){
		$adCount = (new \yii\db\Query())
					->from('wishlist')
					->where(['user_id' => $userId])
					->count();

SELECT COUNT(*) FROM `post_ads` LEFT JOIN `cities` ON post_ads.city = cities.id LEFT JOIN `states` ON post_ads.state = states.id LEFT JOIN `countries` ON post_ads.country = countries.id WHERE `post_ads`.`user_id`=12
SELECT `post_ads`.*, `cities`.`name` AS `city_name`, `states`.`name` AS `state_name`, `countries`.`name` AS `country_name` FROM `post_ads` LEFT JOIN `cities` ON post_ads.city = cities.id LEFT JOIN `states` ON post_ads.state = states.id LEFT JOIN `countries` ON post_ads.country = countries.id WHERE `post_ads`.`user_id`=12 ORDER BY `post_ads`.`id` DESC LIMIT 12
---
	 public function MyAds($user_id = null) {
		$title = Yii::t('frontend', 'My Ads');
		if(!empty($user_id)){
			$userId = $user_id;
		}else{
			$userId = Yii::$app->user->identity['id'];
		}

		$allAds = (new \yii\db\Query())
			->select(['post_ads.*','cities.name as city_name','states.name as state_name','countries.name as country_name'])
			->from('post_ads')
			->leftjoin('cities', 'post_ads.city = cities.id')
			->leftjoin('states', 'post_ads.state = states.id')
			->leftjoin('countries', 'post_ads.country = countries.id')
			->where(['post_ads.user_id' => $userId])
			->orderBy(['post_ads.id' => SORT_DESC]);

		$countQuery = clone $allAds;
		$page_size = Settings::getPageSize();
		$pages = new Pagination(['totalCount' => $countQuery->count(), 'pageSize'=>$page_size]);

		$allAds = $allAds->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `ads_category` WHERE `ad_id`='90'
SELECT `ads_images`.*, `media_upload`.`file_name`, `media_upload`.`upload_base_path` FROM `ads_images` LEFT JOIN `media_upload` ON ads_images.media_id = media_upload.id WHERE `ads_images`.`ad_id`='90'
---
		$ArrAds = array();
		foreach($allAds as $key=>$value){

			$cat_id = (new \yii\db\Query())
					->select(['*'])
					->from('ads_category')
					->where(['ad_id' => $value['id']])
					->all();
			$value['category_id'] =  $cat_id;
			$ArrAds[$i] = $value;

					$images = (new \yii\db\Query())
					->select(['ads_images.*', 'media_upload.file_name', 'media_upload.upload_base_path'])
					->from('ads_images')
					->leftjoin('media_upload', 'ads_images.media_id = media_upload.id')
					->where(['ads_images.ad_id' => $value['id']])
					->all();

SELECT COUNT(*) FROM `post_ads` LEFT JOIN `cities` ON post_ads.city = cities.id LEFT JOIN `states` ON post_ads.state = states.id LEFT JOIN `countries` ON post_ads.country = countries.id WHERE (`post_ads`.`user_id`=12) AND (`post_ads`.`status`='Pending')
SELECT `post_ads`.*, `cities`.`name` AS `city_name`, `states`.`name` AS `state_name`, `countries`.`name` AS `country_name` FROM `post_ads` LEFT JOIN `cities` ON post_ads.city = cities.id LEFT JOIN `states` ON post_ads.state = states.id LEFT JOIN `countries` ON post_ads.country = countries.id WHERE (`post_ads`.`user_id`=12) AND (`post_ads`.`status`='Pending') ORDER BY `post_ads`.`id` DESC LIMIT 12
SELECT * FROM `ads_category` WHERE `ad_id`='90'
SELECT `ads_images`.*, `media_upload`.`file_name`, `media_upload`.`upload_base_path` FROM `ads_images` LEFT JOIN `media_upload` ON ads_images.media_id = media_upload.id WHERE `ads_images`.`ad_id`='90'
---
      public function PendingAds($user_id = null) {
		$title = Yii::t('frontend', 'Pending Ads');
		if(!empty($user_id)){
			$userId = $user_id;
		}else{
			$userId = Yii::$app->user->identity['id'];
		}

			$allAds = (new \yii\db\Query())
				->select(['post_ads.*','cities.name as city_name','states.name as state_name','countries.name as country_name'])
				->from('post_ads')
				->leftjoin('cities', 'post_ads.city = cities.id')
				->leftjoin('states', 'post_ads.state = states.id')
				->leftjoin('countries', 'post_ads.country = countries.id')
				->where(['post_ads.user_id' => $userId])
				->andWhere(['post_ads.status' => PostAd::STATUS_PENDING])
				->orderBy(['post_ads.id' => SORT_DESC]);
			$countQuery = clone $allAds;
			$page_size = Settings::getPageSize();
			$pages = new Pagination(['totalCount' => $countQuery->count(), 'pageSize'=>$page_size]);
			$allAds = $allAds->offset($pages->offset)->limit($pages->limit)->all();


		//echo "<pre>"; print_r($allAds);exit;

		$i = 0;
		$ArrAds = array();
		foreach($allAds as $key=>$value){

			$cat_id = (new \yii\db\Query())
					->select(['*'])
					->from('ads_category')
					->where(['ad_id' => $value['id']])
					->all();
			$value['category_id'] =  $cat_id;
			$ArrAds[$i] = $value;

					$images = (new \yii\db\Query())
					->select(['ads_images.*', 'media_upload.file_name', 'media_upload.upload_base_path'])
					->from('ads_images')
					->leftjoin('media_upload', 'ads_images.media_id = media_upload.id')
					->where(['ads_images.ad_id' => $value['id']])
					->all();