common/models/Review.php

SELECT avg(reviews.rating) as rating FROM `reviews` WHERE (`ad_id`='87') AND (`status`='Active')
---
	public function ReviewCountByAdId($AdId){
		$reviewAvg = (new \yii\db\Query())
					->select('avg(reviews.rating) as rating')
					->from('reviews')
					->where(['ad_id' => $AdId])
					->andwhere(['status' => 'Active'])
					->one();

SELECT COUNT(*) FROM `reviews` WHERE (`ad_id`='87') AND (`status`='Active')
---
	  public function checkAdReviewCount($AdId){
		$reviewCount = (new \yii\db\Query())
					->from('reviews')
					->where(['ad_id' => $AdId])
					->andwhere(['status' => 'Active'])
					->count();

SELECT `reviews`.*, `user_profile`.`name` AS `name`, `user_profile`.`avatar_path` AS `avatar` FROM `reviews` LEFT JOIN `user_profile` ON reviews.user_id = user_profile.user_id WHERE (`reviews`.`ad_id`='87') AND (`reviews`.`status`='Active') ORDER BY `id` DESC LIMIT 6
---
	public function getAdAllReviews($AdId){
		$reviews = (new \yii\db\Query())
					->select(['reviews.*','user_profile.name as name','user_profile.avatar_path as avatar'])
					->from('reviews')
					->leftjoin('user_profile', 'reviews.user_id = user_profile.user_id')
					->where(['reviews.ad_id' => $AdId])
					->andwhere(['reviews.status' => 'Active'])
					->limit(6)
					->orderBy(['id' => SORT_DESC])
					->all();