common/models/States.php

    public static function getStateByCountryId($country_id)
    {
		 $data = States::find()
		->select(['name', 'id'])
		->where(['country_id' => $country_id])
		->orderBy(['id' => SORT_ASC])
		->indexBy('id')
		->asArray()
		->column();
---
SELECT `name`, `id` FROM `states` WHERE `country_id`='113' ORDER BY `id`

    public static function getStates() {

	 $states = (new \yii\db\Query())
				->select(['states.*'])
				->from('states')

				->where(['country_id' => 113]);
	$states = $states->all();
---
SELECT `states`.* FROM `states` WHERE `country_id`=113

	public static function getStateDetail($state_id) {

	 $states = (new \yii\db\Query())
				->select(['states.*'])
				->from('states')

				->where(['id' => $state_id]);
	$states = $states->one();
---
SELECT `states`.* FROM `states` WHERE `id`=2182