common/models/User.php

SELECT * FROM `user` WHERE `mobile`='9024465842'
---
     public function validateUser($identity,$otp=NULL){

			if(!empty($otp)){
				 $search['otp']=$otp;
				   return static::find()
					//->active()
					->andWhere(['mobile'=> $identity])
					->andWhere($search)
					->one();
			}
			else{
				  return static::find()

SELECT * FROM `user` WHERE `mobile`='9024465842'
---
    public function getUserByMobile($mobile){
		$user=User::find()
            ->andWhere(['mobile'=> $mobile])
            ->one();

SELECT * FROM `user` WHERE `id`=12
---
	public function updateOtpLogin($otp,$id){
		$user = User::findOne($id);