common/models/UserSubscription.php

    public function getUserSubscription($user_id) {
		$subscription = (new \yii\db\Query())
					->select(['user_subscription.*','plans.name as plan_name'])
					->from('user_subscription')
					->where(['user_subscription.user_id' => $user_id])
					->leftjoin('plans', 'user_subscription.plan_id = plans.id')
					->one();
---
SELECT `user_subscription`.*, `plans`.`name` AS `plan_name` FROM `user_subscription` LEFT JOIN `plans` ON user_subscription.plan_id = plans.id WHERE `user_subscription`.`user_id`=12