common/models/UserVisits.php

SELECT COUNT(*) FROM `user_visits` WHERE `to_id`=12
---
    public function visitsCountOfUser($user_id){
		$visitsCount = (new \yii\db\Query())
					->from('user_visits')
					->where(['to_id' => $user_id])
					//->groupBy(['ip_address'])
					->count();