common/models/WarningReasons.php

SELECT * FROM `warning_reasons` WHERE `status`=1 GROUP BY `type`
---
    public static function getReson() {
        return self::find()->where(['status' => 1])->groupBy(['type'])->all();