frontend/modules/user/controllers/DefaultController.php

    public function actionDashboard() {

		$s3 = Yii::$app->get('s3');

		$result = $s3->commands()->get('1578485730_avatar.jpg')->execute();
		//echo "<pre>"; print_r($s3);exit;
		//echo "<pre>"; print_r($result);exit;


		$title =  Yii::t('frontend', 'Dashboard');
		$user_id=Yii::$app->user->id;
		$user = User::findOne($user_id);
		$userDetail = UserProfile::findOne($user_id);

        $getUserDetail = UserProfile::findOne($user_id);
---
SELECT * FROM `user` WHERE `id`=12
SELECT * FROM `user_profile` WHERE `user_id`=12

      public function actionMembership() {
		$title = Yii::t('frontend', 'Membership');
		$packages = Packages::AllPackages();


	   if(Yii::$app->request->post()) {
			$post = Yii::$app->request->post();
			return $this->render('payment', ['post' => $post]);
		}

		$userId = Yii::$app->user->identity['id'];
		$subscription = UserSubscription::find()->where(['user_id'=>$userId])->one();
---
SELECT * FROM `user_subscription` WHERE `user_id`=12