frontend/modules/user/controllers/PostadController.php

    public function actionIndex()
    {
		$setting_slug = 'ad_post';
		$ad_setting = SettingsCategory::findOne(['slug' => $setting_slug]);
		$ad_setting_fields = (new \yii\db\Query())
				->select(['*'])
				->from('settings')
				->where(['category' => $ad_setting['id']])
				->all();
---
SELECT * FROM `settings_category` WHERE `slug`='ad_post'
SELECT * FROM `settings` WHERE `category`=5

    public function actionEditAd($id)
    {
		$baseurl = Url::base();
		$userId = Yii::$app->user->identity['id'];
		//  Post Ad Setting //
		$setting_slug = 'ad_post';
		$ad_setting = SettingsCategory::findOne(['slug' => $setting_slug]);

		$ad_setting_fields = (new \yii\db\Query())
				->select(['*'])
				->from('settings')
				->where(['category' => $ad_setting['id']])
				->all();

		foreach($ad_setting_fields as $key=>$field){
			if($field['name']=='max_image_upload'){
				$max_image_upload = $field['value'];
			}
		}
		//  Post Ad Setting //

		$adDetail = (new \yii\db\Query())
					->select(['*'])
					->from('post_ads')
					->where(['id' => $id])
					->andWhere(['user_id' => $userId])
					->one();
		$i = 1;
		$ArrAds = array();
		$cat_id = (new \yii\db\Query())
					->select(['ads_category.id','ads_category.ad_id','ads_category.cat_id','categories.title','categories.slug'])
					->from('ads_category')
					->leftjoin('categories', 'ads_category.cat_id = categories.id')
					->where(['ads_category.ad_id' => $adDetail['id']])
					->all();

		$adDetail['category_id'] =  $cat_id;

		$images = (new \yii\db\Query())
					->select(['id','ad_id','media_id'])
					->from('ads_images')
					->where(['ad_id' => $adDetail['id']])
					->all();
		$adDetail['ads_images'] =  $images;

		$custom_fields = (new \yii\db\Query())
						->select(['id','ad_id','field_id','value'])
						->from('post_ads_custom_fields')
						->where(['ad_id' => $adDetail['id']])
						->all();
---
SELECT * FROM `settings_category` WHERE `slug`='ad_post'
SELECT * FROM `settings` WHERE `category`=5
SELECT * FROM `post_ads` WHERE (`id`='65') AND (`user_id`=12)
SELECT `ads_category`.`id`, `ads_category`.`ad_id`, `ads_category`.`cat_id`, `categories`.`title`, `categories`.`slug` FROM `ads_category` LEFT JOIN `categories` ON ads_category.cat_id = categories.id WHERE `ads_category`.`ad_id`='65'
SELECT `id`, `ad_id`, `media_id` FROM `ads_images` WHERE `ad_id`='65'
SELECT `id`, `ad_id`, `field_id`, `value` FROM `post_ads_custom_fields` WHERE `ad_id`='65'

		$ArrCFields = array();
        foreach($custom_field_ids as $key=>$custom_field_id){

		$custom_fields = (new \yii\db\Query())
						->select(['id','field_type_id','label','isRequired','status'])
						->from('custom_fields')
						->where(['id' => $custom_field_id['field_id']])
						->all();

		$custom_field_options = (new \yii\db\Query())
						->select(['id','field_id','label'])
						->from('custom_field_options')
						->where(['field_id' => $custom_field_id['field_id']])
						->all();
---
SELECT `id`, `field_type_id`, `label`, `isRequired`, `status` FROM `custom_fields` WHERE `id`='16'
SELECT `id`, `field_id`, `label` FROM `custom_field_options` WHERE `field_id`='16'

		$b = 1;
		$ArrCFields2 = array();
		foreach($ArrCFields as $key=>$value){
		$custom_fields_type = (new \yii\db\Query())
							->select(['id','type','data_type','label','options_enabled','options_label','status'])
							->from('custom_field_types')
							->where(['id' => $value['custom_fields']['field_type_id']])
							->all();
---
SELECT `id`, `type`, `data_type`, `label`, `options_enabled`, `options_label`, `status` FROM `custom_field_types` WHERE `id`='2'

		$ArrAds = $adDetail;
		$categories = Olx::getAllCategory();
		$countries = Countries::getAllCountries();
		$states = ArrayHelper::map(States::find()->where(array('country_id' => $adDetail['country']))->all(), 'id', 'name');
		$cities = ArrayHelper::map(Cities::find()->where(array('state_id' => $adDetail['state']))->all(), 'id', 'name');

		//$model = new PostAd();
		$model = PostAd::findOne($id);
---
SELECT * FROM `states` WHERE `country_id`='113'
SELECT * FROM `cities` WHERE `state_id`='2177'
SELECT * FROM `post_ads` WHERE `id`='65'

    public function actionGetSubCategory(){

		$cat_id = Yii::$app->request->post('cat_id');
		$cookies = Yii::$app->request->cookies;

		if(isset($cookies['_locale'])){
		$lang = $cookies['_locale']->value;
		}else{
		$lang = 'en';
		}

        $lists= new Query();
        $lists = Categories::find();
        $lists->select(['categories.*',
					  'categories_lang.id as  cat_lang_id',
					  'categories_lang.category_id','categories_lang.locale','categories_lang.title as cat_lang_title','categories_lang.description as cat_lang_description','categories_lang.slug as cat_lang_slug']);
        $lists->joinWith('categories_lang');
        $lists->andWhere(['categories.status' => 1,'categories.parent_id'=>$cat_id]);
        $lists->all();
---
SELECT `categories`.*, `categories_lang`.`id` AS `cat_lang_id`, `categories_lang`.`category_id`, `categories_lang`.`locale`, `categories_lang`.`title` AS `cat_lang_title`, `categories_lang`.`description` AS `cat_lang_description`, `categories_lang`.`slug` AS `cat_lang_slug` FROM `categories` LEFT JOIN `categories_lang` ON `categories`.`id` = `categories_lang`.`category_id` WHERE (`categories`.`status`=1) AND (`categories`.`parent_id`='1')

	public function actionGetCategoryCustomField(){
		$cat_id = Yii::$app->request->post('cat_id');
		$model = new PostAd();

		$query = new Query();
				 $query->select(['id','field_id','category_id'])->from('categories_custom_fields')
			    ->where(['category_id' => $cat_id]);
		$command = $query->createCommand();
		$custom_field_ids =  $command->queryAll();

		$i = 1;
		$ArrAds = array();

        foreach($custom_field_ids as $key=>$custom_field_id){

		$custom_fields = (new \yii\db\Query())
						->select(['id','field_type_id','label','isRequired','status'])
						->from('custom_fields')
						->where(['id' => $custom_field_id['field_id']])
						->all();

		$custom_field_options = (new \yii\db\Query())
						->select(['id','field_id','label'])
						->from('custom_field_options')
						->where(['field_id' => $custom_field_id['field_id']])
						->all();
---
SELECT `id`, `field_type_id`, `label`, `isRequired`, `status` FROM `custom_fields` WHERE `id`='16'
SELECT `id`, `field_id`, `category_id` FROM `categories_custom_fields` WHERE `category_id`='6'
SELECT `id`, `field_id`, `label` FROM `custom_field_options` WHERE `field_id`='16'

		$j = 1;
		$ArrAds2 = array();
		foreach($ArrAds as $key=>$value){
		$custom_fields_type = (new \yii\db\Query())
							->select(['id','type','data_type','label','options_enabled','options_label','status'])
							->from('custom_field_types')
							->where(['id' => $value['custom_fields']['field_type_id']])
							->all();
---
SELECT `id`, `type`, `data_type`, `label`, `options_enabled`, `options_label`, `status` FROM `custom_field_types` WHERE `id`='2'

	public function actionGetFields(){
		$cat_id = Yii::$app->request->post('cat_id');
		$setting_slug = 'ad_post';
		$ad_setting = SettingsCategory::findOne(['slug' => $setting_slug]);

		$ad_setting_fields = (new \yii\db\Query())
				->select(['*'])
				->from('settings')
				->where(['category' => $ad_setting['id']])
				->all();
---
SELECT * FROM `settings` WHERE `category`=5
SELECT * FROM `settings_category` WHERE `slug`='ad_post'